uhnp/src/Documents/ЦессияВходящая/ЦессияВходящая.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЦессияВходящая</name>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиФакт</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЦессии</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Должник</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорДолжника</name>
    <type>
      <types>DefinedType.ДоговорДолжника</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОбязательства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЦессияИсходящая</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбязательства</name>
    <type>
      <types>EnumRef.ВидыОбязательств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТекущаяЗадолженность</name>
    <attributes>
      <name>ЭлементСтруктурыЗадолженности</name>
      <type>
        <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/ВерсииГрафиковРасчетов/ВерсииГрафиковРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииГрафиковРасчетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОпорныйГрафик</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/AccumulationRegisters/РасчетыСКонтрагентамиГрафики/РасчетыСКонтрагентамиГрафики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСКонтрагентамиГрафики</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СтатьиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПлатежа</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <comment>Операция графика</comment>
    <type>
      <types>CatalogRef.ОперацииГрафиковДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>DefinedType.БанковскийСчетОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>DefinedType.БанковскийСчетКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DefinedType.РегистрацияДанныхБюджетированияСсылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговораУХ</name>
    <type>
      <types>CatalogRef.ВидыДоговоровКонтрагентовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>БезакцептноеСписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ЭлементыСтруктурыЗадолженности/ЭлементыСтруктурыЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭлементыСтруктурыЗадолженности</name>
  <enumValues>
    <name>ОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
  <enumValues>
    <name>Комиссии</name>
  </enumValues>
  <enumValues>
    <name>Штрафы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеКомиссии</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимостьАванс</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>УслугаПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойДолгКонтрагента</name>
    <comment>Основной долг контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыКонтрагента</name>
    <comment>Проценты контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>УслугаПоАрендеАванс</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ОперацииГрафиковДоговоров/ОперацииГрафиковДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОперацииГрафиковДоговоров</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>АккредитивВыданный</name>
      <description>Аккредитив выданный</description>
    </items>
    <items>
      <name>ЛизингПолученный</name>
      <description>Аренда, лизинг</description>
    </items>
    <items>
      <name>ГарантияВыданная</name>
      <description>Банковская гарантия выданная</description>
    </items>
    <items>
      <name>ВалютноПроцентныйСвоп</name>
      <description>Валютно-процентный своп</description>
    </items>
    <items>
      <name>ВалютныйСвоп</name>
      <description>Валютный своп</description>
    </items>
    <items>
      <name>ВалютныйФорвард</name>
      <description>Валютный форвард</description>
    </items>
    <items>
      <name>ВексельВыданный</name>
      <description>Вексель выданный</description>
    </items>
    <items>
      <name>ВексельПолученный</name>
      <description>Вексель полученный</description>
    </items>
    <items>
      <name>Депозит</name>
      <description>Депозит</description>
    </items>
    <items>
      <name>ДоходныйКоммерческийДоговор</name>
      <description>Доходный коммерческий договор</description>
    </items>
    <items>
      <name>ЗаемВыданный</name>
      <description>Заем выданный</description>
    </items>
    <items>
      <name>ЗаемПолученный</name>
      <description>Заем полученный</description>
    </items>
    <items>
      <name>КредитПолученный</name>
      <description>Кредит полученный</description>
    </items>
    <items>
      <name>МНО</name>
      <description>Минимальный неснижаемый остаток</description>
    </items>
    <items>
      <name>ОблигацияВыпущенная</name>
      <description>Облигация выпущенная</description>
    </items>
    <items>
      <name>ОблигацияКупленная</name>
      <description>Облигация купленная</description>
    </items>
    <items>
      <name>Овердрафт</name>
      <description>Овердрафт</description>
    </items>
    <items>
      <name>РасходныйКоммерческийДоговор</name>
      <description>Расходный коммерческий договор</description>
    </items>
  </predefined>
  <attributes>
    <name>ЭлементСтруктурыЗадолженности</name>
    <type>
      <types>EnumRef.ЭлементыСтруктурыЗадолженности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансовогоИнструмента</name>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>КолонкаСекции</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДвижения</name>
    <comment>В зависимости от вида бюджета, либо доход/расход, либо поступление/платеж</comment>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВзаиморасчетов</name>
    <comment>Приход - дебиторская задолженность, расход - кредиторская</comment>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииУХ</name>
    <type>
      <types>CatalogRef.ВидыОперацийУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВводНачальныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийВводНачальныхОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Documents/ЦессияВходящая/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс
// Подготовить параметры проведения
//
// Параметры:
//  ДокументСсылка	 - ДокументСсылкаЦессияВходящая	 - документ Цессия входящая
//  Отказ			 - Булево	 - отказ 
// 
// Возвращаемое значение:
//  Структура - параметры для проведения документа
//
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ТаблицыДляДвижений 		= Новый Структура;		
	ДополнительныеСвойства 	= Новый Структура;
	НомераТаблиц 			= Новый Структура;
	
	// реквизиты документа.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст 	= ТекстЗапросаРеквизитыДокумента();	
	Реквизиты 		= ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Запрос.Выполнить().Выгрузить()[0]);

	ДополнительныеСвойства.Вставить("Реквизиты", Реквизиты);
	
	Если Отказ Тогда
		Возврат ДополнительныеСвойства;
	КонецЕсли;
	
	Для Каждого КлючИЗначение Из Реквизиты Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ПериодГраница", 		Новый Граница(Реквизиты.МоментВремени, ВидГраницы.Исключая));
	
	ТекстЗапроса = Новый Массив;
	ТекстЗапроса.Добавить(ТекстЗапросаРасчетыСКонтрагентамиФакт(НомераТаблиц, 		"РасчетыСКонтрагентамиФакт"));
	ТекстЗапроса.Добавить(ТекстЗапросаРасчетыСКонтрагентамиГрафики(НомераТаблиц,	"РасчетыСКонтрагентамиГрафики"));
	Запрос.Текст = СтрСоединить(ТекстЗапроса, ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета());	
	
	Результат = Запрос.ВыполнитьПакет();

	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		Если СтрНачинаетсяС(НомерТаблицы.Ключ, "Таблица") Или СтрНачинаетсяС(НомерТаблицы.Ключ, "вт") Или (НомерТаблицы.Ключ = "ОшибкиПроводок") Тогда			
			Продолжить;
		КонецЕсли;
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
			
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", ТаблицыДляДвижений);
	
	Возврат ДополнительныеСвойства;

КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.   
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаРеквизитыДокумента(НомераТаблиц = Неопределено)

	Если НомераТаблиц <> Неопределено Тогда
		НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());	
	КонецЕсли;	
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Ссылка,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.МоментВремени КАК МоментВремени,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	Реквизиты.ДоговорЦессии КАК ДоговорЦессии,
	|	Реквизиты.Должник КАК Должник,
	|	Реквизиты.ДоговорДолжника КАК ДоговорДолжника,
	|	Реквизиты.СуммаОбязательства КАК СуммаОбязательства,
	|	Реквизиты.СтавкаНДС КАК СтавкаНДС,
	|	Реквизиты.СуммаНДС КАК СуммаНДС,
	|	Реквизиты.СуммаДокумента КАК СуммаДокумента,
	|	Реквизиты.ВалютаДокумента КАК ВалютаДокумента,
	|	Реквизиты.ДоговорЦессии.ВидДоговораУХ КАК ДоговорЦессииВидДоговораУХ,
	|	Реквизиты.ДоговорДолжника.ВидДоговораУХ КАК ДоговорДолжникаВидДоговораУХ
	|ИЗ
	|	Документ.ЦессияВходящая КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаРасчетыСКонтрагентамиФакт(НомераТаблиц, ИмяТаблицы)
	
	НомераТаблиц.Вставить(ИмяТаблицы, НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&ВалютаДокумента КАК Валюта,
	|	&ДоговорДолжника КАК ОбъектРасчетов,
	|	&ДоговорДолжника КАК ДоговорКонтрагента,
	|	&ДоговорДолжникаВидДоговораУХ КАК ВидДоговораУХ,
	|	ЦессияВходящаяТекущаяЗадолженность.Сумма КАК Сумма,
	|	NULL КАК Операция,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ЦессияВходящаяТекущаяЗадолженность.ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности,
	|	NULL КАК СтатьяБюджета,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов) КАК ВидБюджета,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход) КАК ПриходРасход
	|ИЗ
	|	Документ.ЦессияВходящая.ТекущаяЗадолженность КАК ЦессияВходящаяТекущаяЗадолженность
	|ГДЕ
	|	ЦессияВходящаяТекущаяЗадолженность.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период,
	|	&Организация,
	|	&Контрагент,
	|	&ВалютаДокумента,
	|	&ДоговорЦессии,
	|	&ДоговорЦессии,
	|	&ДоговорЦессииВидДоговораУХ,
	|	&СуммаДокумента,
	|	NULL,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг),
	|	NULL,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыБюджетов.БюджетДоходовИРасходов),
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)";
	
	Возврат ТекстЗапроса;


КонецФункции

Функция ТекстЗапросаРасчетыСКонтрагентамиГрафики(НомераТаблиц, ИмяТаблицы)

	НомераТаблиц.Вставить("ТаблицаГрафика", 	НомераТаблиц.Количество());
	НомераТаблиц.Вставить(ИмяТаблицы, 			НомераТаблиц.Количество());
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ВерсииГрафиковРасчетовСрезПоследних.Регистратор КАК ВерсияГрафика
		|ПОМЕСТИТЬ ТаблицаГрафика
		|ИЗ
		|	РегистрСведений.ВерсииГрафиковРасчетов.СрезПоследних(
		|			&ПериодГраница,
		|			Организация = &Организация
		|				И ПредметГрафика = &ДоговорЦессии) КАК ВерсииГрафиковРасчетовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Период КАК Период,
		|	ИСТИНА КАК Активность,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Ссылка КАК ВерсияГрафика,
		|	РасчетыСКонтрагентамиГрафикиОстатки.Организация КАК Организация,
		|	&ДоговорДолжника КАК ПредметГрафика,
		|	РасчетыСКонтрагентамиГрафикиОстатки.ЭлементСтруктурыЗадолженности КАК ЭлементСтруктурыЗадолженности,
		|	РасчетыСКонтрагентамиГрафикиОстатки.Валюта КАК Валюта,
		|	РасчетыСКонтрагентамиГрафикиОстатки.СуммаОстаток КАК Сумма,
		|	НЕОПРЕДЕЛЕНО КАК СтатьяБюджета,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ПриходРасход,
		|	ВЫБОР
		|		КОГДА РасчетыСКонтрагентамиГрафикиОстатки.ЭлементСтруктурыЗадолженности = ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ЗаемПолученный_ПрекращениеОбязательстваОсновнойДолг)
		|		КОГДА РасчетыСКонтрагентамиГрафикиОстатки.ЭлементСтруктурыЗадолженности = ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.Комиссии)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ЗаемПолученный_ПрекращениеОбязательстваКомиссии)
		|		КОГДА РасчетыСКонтрагентамиГрафикиОстатки.ЭлементСтруктурыЗадолженности = ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.Проценты)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ЗаемПолученный_ПрекращениеОбязательстваПроценты)
		|		КОГДА РасчетыСКонтрагентамиГрафикиОстатки.ЭлементСтруктурыЗадолженности = ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.Штрафы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ОперацииГрафиковДоговоров.ЗаемПолученный_ПрекращениеОбязательстваШтрафы)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Операция,
		|	&Должник КАК Должник
		|ИЗ
		|	РегистрНакопления.РасчетыСКонтрагентамиГрафики.Остатки(
		|			&ПериодГраница,
		|			ВерсияГрафика В
		|				(ВЫБРАТЬ
		|					ТаблицаГрафика.ВерсияГрафика
		|				ИЗ
		|					ТаблицаГрафика)) КАК РасчетыСКонтрагентамиГрафикиОстатки";
		
	Возврат ТекстЗапроса;
	
 КонецФункции

#КонецОбласти  


#КонецЕсли
